[
    {
      "id": 1,
      "title": "2.1C Reflection",
      "body": "I learnt better how to use the Vue-3 concepts. Using v-if and v-else to show how changing Boolean conditions will run one or the other conditions. V-show can be used to hide or unhide elements which could be very useful. V-for was shown in the Tic Tac Toe game for creating the board at the given 2D array size, combining 2 v-for loops as well as tracking and updating moves made to the right square. I also used v-for with v-if to render certain elements in an array depending on if the v-if statement was true or not. For the form input handling I used v-model inputValue to dynamically update and display back to the user the information that they enter into a text box. In the To-do app v-model was used to update when users added a new task and checked off a task to ensure they were updated appropriately. V-for was used to handle the tasks in the array, ensuring they were added and removed correctly. I used CSS to ensure the site use aesthetic and user friendly. Creating an easy-to-read interface such as having contrasting colours and alternating colours between tasks elements. I also used view window sizing for the header to ensure it scaled appropriately as well as @media screen so that when the window was small enough the elements stacked on top of each other, so they were framed better. I used effects like hover to change the curser to users knew things were pressable as well as colour changes on active pressing of a button, the text box also gets a border when active."
    },
    {
      "id": 2,
      "title": "1.3P Reflection",
      "body": "I used the Vue framework to create a portfolio website to replace a CV, it included a home, about, portfolio and contact page. I made the website responsive by using “em” for some text sizes and padding/margins as well as vh to ensure responsiveness for components such as the background. I also used % size for images and tables to make them fit more appropriately in screens. I used HTML features such as forms, headers, favicon, table, nav and so much more to build a good structure for my site. I used the Vue router to allow navigation between each of the sections as listed earlier. I used v-for and v-if to handle displaying the projects on the portfolio page. I also used v-models in my contact form and vbind in displaying project images. I used many various Vue components and to give life to the website and make it look and function better."
    },
    {
      "id": 3,
      "title": "3.1D Reflection",
      "body": "This version of my ecommerce website was much more fleshed out. The responsiveness was much better with more media queries and use of viewport, percentages etc, this fixed some of the images that were outside of the screen and other components that didn’t fit. I also used transitions like changing the background colour of items with ease affect or animations which made a ball bounce or enlarged containers on hover. I added a favicon which wasn’t included before as well as media in the form of photos and a working embedded YouTube video. I added a couple graphics using canvas to draw a small dumbbell on one screen as well as using SVG to create and animate a ball when hovering over it. I changed the routing to use the advance navigation with vue router. And I also used vue components for the ChatBot, Navigation bar as well the cart for storing items. I used the localStorage to remember items stored and removed from cart so that users could look around the site and return to their cart when they wanted to and the items remained in there, it emptied every time the products page was left in the previous version. Similarly I also fixed the login to also remember and show the users login name on the nav bar as before this also disappeared when you visited other views. I fixed the login too to make sure that the email address was valid as before an invalid email address was allowed for registration. I added a checkout function as well that also shows the users total amount and when they confirm checkout an alert tell them that the order is confirmed. I chose to implement the google maps integration which I used to create a map inside my about ussection. I then chose where in the world the map was to show, which I picked Deakin University, and then I added marker to show a specific location and so it was easy to return to if the user moved the map. The map was also interactable and not static. The other feature I chose to implement was a live chat/ customer service bot. Which I gave some basic input and outputs for when it didn’t understand what the user was saying or if the user was going off script. I also gave it parameters for users to ask for help with buying a product, which the bot then had a number of conversational Reponses that it prompted the user with and the conversation would flow as it would ask what item did you want help with and the user would say the item and it would recognise that and ask the next prompt and recognise quantity of item. Overall the website is much more function than the original, I was happy with most of the styling so the overall aesthetic is the same as the proof of concept but all the features that weren’t functional or were broken got fixed to work as well as a number of other features and just fixing up some code to make it better and easier to use and read."
    }
  ]